PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_dma.h
#define DMA_ES_DBE                        (1 << 0)  /* Bit 0:  Destination bus error */
#define DMA_ES_SBE                        (1 << 1)  /* Bit 1:  Source bus error */
#define DMA_ES_SGE                        (1 << 2)  /* Bit 2:  Scatter/gather configuration error */
#define DMA_ES_NCE                        (1 << 3)  /* Bit 3:  NBYTES/CITER configuration error */
#define DMA_ES_DOE                        (1 << 4)  /* Bit 4:  Destination offset error */
#define DMA_ES_DAE                        (1 << 5)  /* Bit 5:  Destination address error */
#define DMA_ES_SOE                        (1 << 6)  /* Bit 6:  Source offset error */
#define DMA_ES_SAE                        (1 << 7)  /* Bit 7:  Source address error */
#define DMA_ES_ERRCHN_SHIFT               (8)       /* Bits 8-11: Error channel number or cancelled channel number */
#define DMA_ES_ERRCHN_MASK                (15 << DMA_ES_ERRCHN_SHIFT)
                                                    /* Bits 12-13: Reserved */
#define DMA_ES_CPE                        (1 << 14) /* Bit 14:  Channel priority error */
                                                    /* Bit 15: Reserved */
#define DMA_ES_ECX                        (1 << 16) /* Bit 16:  Transfer cancelled */
                                                    /* Bits 17-30: Reserved */
#define DMA_ES_VLD                        (1 << 31) /* Bit 31:  Logical OR of all ERR status bits */

/* Enable Request Register, Enable Error Interrupt Register, Interrupt Request Register,  Error
 * Register, Hardware Request Status Register common bit definitions (32-bit, except for Error
 * Register which is 16-bit)
 */

#define DMA_REQ(n)                        (1 << (n)) /* Bit n: DMA Request n */
#define DMA_REQ0                          (1 << 0)  /* Bit 0:  DMA Request 0 */
#define DMA_REQ1                          (1 << 1)  /* Bit 1:  DMA Request 1 */
#define DMA_REQ2                          (1 << 2)  /* Bit 2:  DMA Request 2 */
#define DMA_REQ3                          (1 << 3)  /* Bit 3:  DMA Request 3 */
#define DMA_REQ4                          (1 << 4)  /* Bit 4:  DMA Request 4 */
#define DMA_REQ5                          (1 << 5)  /* Bit 5:  DMA Request 5 */
#define DMA_REQ6                          (1 << 6)  /* Bit 6:  DMA Request 6 */
#define DMA_REQ7                          (1 << 7)  /* Bit 7:  DMA Request 7 */
#define DMA_REQ8                          (1 << 8)  /* Bit 8:  DMA Request 8 */
#define DMA_REQ9                          (1 << 9)  /* Bit 9:  DMA Request 9 */
#define DMA_REQ10                         (1 << 10) /* Bit 10: DMA Request 10 */
#define DMA_REQ11                         (1 << 11) /* Bit 11: DMA Request 11 */
#define DMA_REQ12                         (1 << 12) /* Bit 12: DMA Request 12 */
#define DMA_REQ13                         (1 << 13) /* Bit 13: DMA Request 13 */
#define DMA_REQ14                         (1 << 14) /* Bit 14: DMA Request 14 */
#define DMA_REQ15                         (1 << 15) /* Bit 15: DMA Request 15 */
                                                    /* Bits 16-31: Reserved */
/* Clear Enable Error Interrupt Register (8-bit) */

#define DMA_CEEI_SHIFT                    (0)       /* Bits 0-3: Clear enable error interrupt */
#define DMA_CEEI_MASK                     (15 << DMA_CEEI_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_CEEI_CAEE                     (1 << 6)  /* Bit 6:  Clear all enable error interrupts */
#define DMA_CEEI_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Set Enable Error Interrupt Register (8-bit) */

#define DMA_SEEI_SHIFT                    (0)       /* Bits 0-3: Set enable error interrupt */
#define DMA_SEEI_MASK                     (15 << DMA_SEEI_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_SEEI_SAEE                     (1 << 6)  /* Bit 6:  Set all enable error interrupts */
#define DMA_SEEI_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Clear Enable Request Register (8-bit) */

#define DMA_CERQ_SHIFT                    (0)       /* Bits 0-3: Clear enable request */
#define DMA_CERQ_MASK                     (15 << DMA_CERQ_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_CERQ_CAER                     (1 << 6)  /* Bit 6:  Clear all enable requests */
#define DMA_CERQ_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Set Enable Request Register (8-bit) */

#define DMA_SERQ_SHIFT                    (0)       /* Bits 0-3: Set enable request */
#define DMA_SERQ_MASK                     (15 << DMA_SERQ_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_SERQ_SAER                     (1 << 6)  /* Bit 6:  Set all enable requests */
#define DMA_SERQ_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Clear DONE Status Bit Register (8-bit) */

#define DMA_CDNE_SHIFT                    (0)       /* Bits 0-3: Clear DONE bit */
#define DMA_CDNE_MASK                     (15 << DMA_CDNE_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_CDNE_CADN                     (1 << 6)  /* Bit 6:  Clears all DONE bits */
#define DMA_CDNE_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Set START Bit Register (8-bit) */

#define DMA_SSRT_SHIFT                    (0)       /* Bits 0-3: Set START bit */
#define DMA_SSRT_MASK                     (15 << DMA_SSRT_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_SSRT_SAST                     (1 << 6)  /* Bit 6:  Set all START bits (activates all channels) */
#define DMA_SSRT_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Clear Error Register (8-bit) */

#define DMA_CERR_SHIFT                    (0)       /* Bits 0-3: Clear error indicator */
#define DMA_CERR_MASK                     (15 << DMA_CERR_SHIFT)
                                                    /* Bits 4-5: Reserved */
#define DMA_CERR_CAEI                     (1 << 6)  /* Bit 6:  Clear all error indicators */
#define DMA_CERR_NOP                      (1 << 7)  /* Bit 7:  No operation */

/* Clear Interrupt Request Register (8-bit) */

